nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_gpio.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief GPIO driver version. */
#define FSL_GPIO_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*! @brief Helper MACRO function to extract Port Index. (GPIOA, GPIOB, GPIOC, and so on.)
 *  The fields located in bit 8 - bit 11.*/
#define GPIO_MUX_ENUM_TO_PORT_INDEX(emux) (((uint16_t)(emux)&0xF00U) >> 0x08U)

/*! @brief Helper MACRO function to extract Pin Index. The fields located in bit 4 - bit 7. */
#define GPIO_MUX_ENUM_TO_PIN_INDEX(emux) (((uint16_t)(emux)&0xF0U) >> 0x04U)

/*! @brief Helper MACRO function to extract Pin mux config register value. The fields located in bit 0 - bit 1. */
#define GPIO_MUX_ENUM_TO_REG_VALUE(emux) ((uint16_t)(emux)&0x3U)

/*! @brief Helper MACRO function to extract Pin mux config mask. */
#define GPIO_MUX_ENUM_TO_PIN_MASK(emux)                                                           \
    ((GPIO_MUX_ENUM_TO_PIN_INDEX(emux) < 8U) ? (3UL << (GPIO_MUX_ENUM_TO_PIN_INDEX(emux) * 2U)) : \
                                               (3UL << ((GPIO_MUX_ENUM_TO_PIN_INDEX(emux) - 8U) * 2U)))

/*! @brief Helper MACRO function to extract Pin mux config register value on a GPIO Pin. */
#define GPIO_MUX_ENUM_TO_PIN_VALUE(emux)                                                 \
    ((GPIO_MUX_ENUM_TO_PIN_INDEX(emux) < 8U) ?                                           \
         (GPIO_MUX_ENUM_TO_REG_VALUE(emux) << (GPIO_MUX_ENUM_TO_PIN_INDEX(emux) * 2U)) : \
         (GPIO_MUX_ENUM_TO_REG_VALUE(emux) << ((GPIO_MUX_ENUM_TO_PIN_INDEX(emux) - 8U) * 2U)))

/*! @brief GPIO Pin identifier with each pin get a unique bit thus they can be ORed. */
typedef enum _gpio_pin
{
    kGPIO_Pin0  = (0x1U << 0U),  /*!< GPIO PORT Pin  0. */
    kGPIO_Pin1  = (0x1U << 1U),  /*!< GPIO PORT Pin  1. */
    kGPIO_Pin2  = (0x1U << 2U),  /*!< GPIO PORT Pin  2. */
    kGPIO_Pin3  = (0x1U << 3U),  /*!< GPIO PORT Pin  3. */
    kGPIO_Pin4  = (0x1U << 4U),  /*!< GPIO PORT Pin  4. */
    kGPIO_Pin5  = (0x1U << 5U),  /*!< GPIO PORT Pin  5. */
    kGPIO_Pin6  = (0x1U << 6U),  /*!< GPIO PORT Pin  6. */
    kGPIO_Pin7  = (0x1U << 7U),  /*!< GPIO PORT Pin  7. */
    kGPIO_Pin8  = (0x1U << 8U),  /*!< GPIO PORT Pin  8. */
    kGPIO_Pin9  = (0x1U << 9U),  /*!< GPIO PORT Pin  9. */
    kGPIO_Pin10 = (0x1U << 10U), /*!< GPIO PORT Pin 10. */
    kGPIO_Pin11 = (0x1U << 11U), /*!< GPIO PORT Pin 11. */
    kGPIO_Pin12 = (0x1U << 12U), /*!< GPIO PORT Pin 12. */
    kGPIO_Pin13 = (0x1U << 13U), /*!< GPIO PORT Pin 13. */
    kGPIO_Pin14 = (0x1U << 14U), /*!< GPIO PORT Pin 14. */
    kGPIO_Pin15 = (0x1U << 15U), /*!< GPIO PORT Pin 15. */
} gpio_pin_t;

/*! @brief GPIO Pin peripheral/gpio mode option. */
typedef enum _gpio_peripheral_mode
{
    kGPIO_ModeGpio       = 0U, /*!< Set GPIO pin as GPIO Mode. */
    kGPIO_ModePeripheral = 1U, /*!< Set GPIO pin as Peripheral Mode. */
} gpio_peripheral_mode_t;

/*! @brief GPIO Pin input/output direction option. */
typedef enum _gpio_direction
{
    kGPIO_DigitalInput  = 0U, /*!< Set GPIO pin as digital input. */
    kGPIO_DigitalOutput = 1U, /*!< Set GPIO pin as digital output. */
} gpio_direction_t;

/*! @brief GPIO Pin pull resistor mode option. */
typedef enum _gpio_pull_mode
{
    kGPIO_PullDown    = 0U, /*!< Internal pull-down resistor is enabled. */
    kGPIO_PullUp      = 1U, /*!< Internal pull-up resistor is enabled. */
    kGPIO_PullDisable = 2U, /*!< Internal pull-up/down resistor is disabled. */
} gpio_pull_mode_t;

/*! @brief GPIO Pin output mode option. */
typedef enum _gpio_output_mode
{
    kGPIO_OutputOpenDrain = 0U, /*!< Open drain output mode. */
    kGPIO_OutputPushPull  = 1U, /*!< Push pull output mode. */
} gpio_output_mode_t;

/*! @brief GPIO Pin output High/Low level option. */
typedef enum _gpio_output_level
{
    kGPIO_OutputLow  = 0U, /*!< Set GPIO pin output low voltage level. */
    kGPIO_OutputHigh = 1U, /*!< Set GPIO pin output high voltage level. */
} gpio_output_level_t;

/*! @brief GPIO Pin output Fast/Slow slew rate option. */
typedef enum _gpio_output_slew_rate
{
    kGPIO_SlewRateFast = 0U, /*!< Set GPIO pin output Fast slew rate. */
    kGPIO_SlewRateSlow = 1U, /*!< Set GPIO pin output Slow slew rate. */
} gpio_output_slew_rate_t;

/*! @brief GPIO Pin output High/Low drive strength option. */
typedef enum _gpio_output_drive_strength
{
    kGPIO_DriveStrengthLow  = 0U, /*!< Set GPIO pin output Low-drive strength. */
    kGPIO_DriveStrengthHigh = 1U, /*!< Set GPIO pin output High-drive strength. */
} gpio_output_drive_strength_t;

/*! @brief GPIO Pin interrupt detect option. */
typedef enum _gpio_interrupt_mode
{
    kGPIO_InterruptRisingEdge  = 0x0U, /*!< Interrupt on rising edge. */
    kGPIO_InterruptFallingEdge = 0x1U, /*!< Interrupt on falling edge. */
    kGPIO_InterruptDisable     = 0x2U, /*!< Interrupt is disabled. */
} gpio_interrupt_mode_t;

/*! @brief GPIO Pin configuration covering all configurable fields when GPIO is configured in GPIO mode. */
typedef struct _gpio_config
{
    /* GPIO Pin General configuration. */
    gpio_direction_t eDirection; /*!< GPIO direction, input or output */

    /* GPIO Mode configuration */
    gpio_peripheral_mode_t eMode; /*!< GPIO mode as peripheral or GPIO */
    gpio_peripheral_mux_t eMux;   /*!< Set the peripheral type if GPIO is configured as peripheral */

    /* GPIO pin configuration */
    gpio_output_mode_t eOutMode;                 /*!< GPIO Open-Drain/Push-Pull output mode. */
    gpio_output_slew_rate_t eSlewRate;           /*!< GPIO Fast/Slow slew rate output mode. */
    gpio_output_level_t eOutLevel;               /*!< GPIO Output High/Low level. */
    gpio_output_drive_strength_t eDriveStrength; /*!< GPIO output Drive strength High/Low. */
    gpio_pull_mode_t ePull;                      /*!< GPIO Pull resistor mode configuration. */
    gpio_interrupt_mode_t eInterruptMode;        /*!< GPIO interrupt detection condition configuration. */
} gpio_config_t;

#if defined(__cplusplus)
extern "C" {
#endif /* _cplusplus */

/*!
 * @name Initialization and De-initialization Interfaces
 * @{
 */

/*!
 * @brief Initializes a GPIO pin with provided structure @ref _gpio_config covering all configuration fields.
 *
 * To initialize the GPIO, define a pin configuration, as either input or output, in the user file.
 * Then, call the GPIO_PinInit() function.
 *
 * @note If GPIO glitch is critical for your application, do not use this API instead using the API in GPIO
 * pin configuration interfaces to do with the glitch during GPIO mode transition in accordance to your
 * board design.
 *
 * This is function to configure all GPIO Pin configurable fields.
 * @code
        gpio_config_t sConfig = {
            .eDirection     = kGPIO_DigitalOutput,
            .eMode          = kGPIO_ModeGpio,
            .eOutMode       = kGPIO_OutputOpenDrain,
            .eSlewRate      = kGPIO_SlewRateFast,
            .eOutLevel      = kGPIO_OutputLow,
            .eDriveStrength = kGPIO_DriveStrengthLow,
            .ePull          = kGPIO_PullDisable,
            .eInterruptMode = kGPIO_InterruptDisable,
       }
        GPIO_PinInit(GPIOA, kGPIO_Pin1, &psConfig);
   @endcode
 *
 * @param base      GPIO peripheral base pointer (GPIOA, GPIOB, GPIOC, and so on.)
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 * @param psConfig  GPIO pin configuration pointer
 */
void GPIO_PinInit(GPIO_Type *base, gpio_pin_t ePin, const gpio_config_t *psConfig);

/* @} */

/*!
 * @name GPIO Peripheral Mode Interfaces
 * @{
 */

/*!
 * @brief Configure the GPIO Pin as Peripheral mode or GPIO mode for one pin.
 *
 * Configure GPIO can be configured as Peripheral mode or GPIO mode for one pin.
 *
 * @param base  GPIO peripheral base pointer
 * @param ePin  GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *              in SoC and user need to check the data sheet.
 * @param eMode Peripheral mode or GPIO mode for this pin. See @ref _gpio_peripheral_mode
 */
static inline void GPIO_PinSetPeripheralMode(GPIO_Type *base, gpio_pin_t ePin, gpio_peripheral_mode_t eMode)
{
    if (eMode == kGPIO_ModeGpio)
    {
        base->PER &= ~(uint16_t)ePin;
    }
    else
    {
        base->PER |= (uint16_t)ePin;
    }
}

/*!
 * @brief Configure the multiplexing of GPIO pins to different peripheral.
 *
 * Configure the MUX of GPIO pins to different peripheral functionality.
 * @note User still need to call the GPIO_PinSetPeripheralMode.
 *
 * @param eMux  GPIO peripheral MUX when configured as peripheral mode. See @ref _gpio_peripheral_mux
 */
#pragma bfsc force
static inline void GPIO_PinSetPeripheralMux(gpio_peripheral_mux_t eMux)
{
    if (GPIO_MUX_ENUM_TO_PORT_INDEX(eMux) == 0U)
    {
        if (GPIO_MUX_ENUM_TO_PIN_INDEX(eMux) < 8U)
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSAL) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSAL > 0U))
            PeriphWriteBitGroup(SIM->GPSAL, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
        else
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSAH) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSAH > 0U))
            PeriphWriteBitGroup(SIM->GPSAH, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
    }
    else if (GPIO_MUX_ENUM_TO_PORT_INDEX(eMux) == 1U)
    {
        if (GPIO_MUX_ENUM_TO_PIN_INDEX(eMux) < 8U)
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSBL) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSBL > 0U))
            PeriphWriteBitGroup(SIM->GPSBL, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
        else
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSBH) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSBH > 0U))
            PeriphWriteBitGroup(SIM->GPSBH, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
    }
    else if (GPIO_MUX_ENUM_TO_PORT_INDEX(eMux) == 2U)
    {
        if (GPIO_MUX_ENUM_TO_PIN_INDEX(eMux) < 8U)
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSCL) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSCL > 0U))
            PeriphWriteBitGroup(SIM->GPSCL, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
        else
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSCH) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSCH > 0U))
            PeriphWriteBitGroup(SIM->GPSCH, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
    }
    else if (GPIO_MUX_ENUM_TO_PORT_INDEX(eMux) == 3U)
    {
        if (GPIO_MUX_ENUM_TO_PIN_INDEX(eMux) < 8U)
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSDL) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSDL > 0U))
            PeriphWriteBitGroup(SIM->GPSDL, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
        else
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSDH) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSDH > 0U))
            PeriphWriteBitGroup(SIM->GPSDH, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
    }
    else if (GPIO_MUX_ENUM_TO_PORT_INDEX(eMux) == 4U)
    {
        if (GPIO_MUX_ENUM_TO_PIN_INDEX(eMux) < 8U)
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSEL) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSEL > 0U))
            PeriphWriteBitGroup(SIM->GPSEL, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
        else
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSEH) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSEH > 0U))
            PeriphWriteBitGroup(SIM->GPSEH, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
    }
    else if (GPIO_MUX_ENUM_TO_PORT_INDEX(eMux) == 5U)
    {
        if (GPIO_MUX_ENUM_TO_PIN_INDEX(eMux) < 8U)
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSFL) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSFL > 0U))
            PeriphWriteBitGroup(SIM->GPSFL, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
        else
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSFH) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSFH > 0U))
            PeriphWriteBitGroup(SIM->GPSFH, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
    }
    else if (GPIO_MUX_ENUM_TO_PORT_INDEX(eMux) == 6U)
    {
        if (GPIO_MUX_ENUM_TO_PIN_INDEX(eMux) < 8U)
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSGL) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSGL > 0U))
            PeriphWriteBitGroup(SIM->GPSGL, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
        else
        {
#if (defined(FSL_FEATURE_SIM_PINMUX_HAS_GPSGH) && (FSL_FEATURE_SIM_PINMUX_HAS_GPSGH > 0U))
            PeriphWriteBitGroup(SIM->GPSGH, GPIO_MUX_ENUM_TO_PIN_MASK(eMux), GPIO_MUX_ENUM_TO_PIN_VALUE(eMux));
#endif
        }
    }
}
#pragma bfsc on

/* @} */

/*!
 * @name GPIO Pin Configuration Interfaces
 * @{
 */

/*!
 * @brief Configure the GPIO pin as Input or Output for one pin.
 *
 * Configure the GPIO pin as Input or Output for one pin.
 *
 * @param base          GPIO peripheral base pointer
 * @param ePin          GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                      in SoC and user need to check the data sheet.
 * @param eDirection    Direction of GPIO pin. @ref _gpio_direction
 */
static inline void GPIO_PinSetDirection(GPIO_Type *base, gpio_pin_t ePin, gpio_direction_t eDirection)
{
    if (eDirection == kGPIO_DigitalInput)
    {
        base->DDR &= ~(uint16_t)ePin;
    }
    else
    {
        base->DDR |= (uint16_t)ePin;
    }
}

/*!
 * @brief Configure GPIO pin output as Push-Pull or Open-Drain for one pin
 *
 * Configure GPIO pin output as Push-Pull or Open-Drain. This function applies while pin
 * is configured as output. See @ref _gpio_direction and API GPIO_PinSetDirection.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 * @param eOutMode  Push-Pull/Open-Drain output mode. See @ref _gpio_output_mode.
 */
static inline void GPIO_PinSetOutputMode(GPIO_Type *base, gpio_pin_t ePin, gpio_output_mode_t eOutMode)
{
    if (eOutMode == kGPIO_OutputOpenDrain)
    {
        base->PPMODE &= ~(uint16_t)ePin;
    }
    else
    {
        base->PPMODE |= (uint16_t)ePin;
    }
}

/*!
 * @brief Configure High/Low drive strength when Pin is configured as output for one pin.
 *
 * Configure High/Low drive strength when Pin is configured as output. See
 * @ref _gpio_direction and API GPIO_PinSetDirection.
 *
 * @param base              GPIO peripheral base pointer
 * @param ePin              GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins
 * existed in SoC and user need to check the data sheet.
 * @param eDriveStrength    High/Low driver strength. See @ref _gpio_output_drive_strength
 */
static inline void GPIO_PinSetDriveStrength(GPIO_Type *base,
                                            gpio_pin_t ePin,
                                            gpio_output_drive_strength_t eDriveStrength)
{
    if (eDriveStrength == kGPIO_DriveStrengthLow)
    {
        base->DRIVE &= ~(uint16_t)ePin;
    }
    else
    {
        base->DRIVE |= (uint16_t)ePin;
    }
}

/*!
 * @brief Configure GPIO pin Fast/Slow slew rate when pin is configured as output.
 *
 * Configure GPIO pin Fast/Slow slew rate when pin is configured as output. See
 * @ref _gpio_direction and API GPIO_PinSetDirection.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 * @param eSlewRate Fast/Slow slewrate. See @ref _gpio_output_slew_rate
 */
static inline void GPIO_PinSetSlewRate(GPIO_Type *base, gpio_pin_t ePin, gpio_output_slew_rate_t eSlewRate)
{
    if (eSlewRate == kGPIO_SlewRateFast)
    {
        base->SRE &= ~(uint16_t)ePin;
    }
    else
    {
        base->SRE |= (uint16_t)ePin;
    }
}

/*!
 * @brief Configure Pull resistor for GPIO pin to Disable/Pull-Up/Pull-Down.
 *
 * Configure Pull resistor for GPIO pin to Disable/Pull-Up/Pull-Down.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 * @param ePullMode Pull Mode as Disable/Pull-Up/Pull-Down. See @ref _gpio_pull_mode
 */
static inline void GPIO_PinSetPullResistorMode(GPIO_Type *base, gpio_pin_t ePin, gpio_pull_mode_t ePullMode)
{
    if (ePullMode != kGPIO_PullDisable)
    {
        /* Configure the Pull Up/Down*/
        if (ePullMode == kGPIO_PullDown)
        {
            base->PUS &= ~(uint16_t)ePin;
        }
        else
        {
            base->PUS |= (uint16_t)ePin;
        }
        /* Enable the pull resistor. */
        base->PUR |= (uint16_t)ePin;
    }
    else
    {
        /* Disable the pull resistor. */
        base->PUR &= ~(uint16_t)ePin;
    }
}

/* @} */

/*!
 * @name GPIO PIN/PORT Write/Read/Toggle Interfaces
 * @{
 */

/*!
 * @brief Set GPIO Pin as High/Low voltage level on Output.
 *
 * Set GPIO Pin as High/Low voltage level on Output.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 * @param eOutput   Output as High level or Low Level. See @ref _gpio_output_level.
 */
static inline void GPIO_PinWrite(GPIO_Type *base, gpio_pin_t ePin, gpio_output_level_t eOutput)
{
    if (eOutput == kGPIO_OutputLow)
    {
        base->DR &= ~(uint16_t)ePin;
    }
    else
    {
        base->DR |= (uint16_t)ePin;
    }
}

/*!
 * @brief Set GPIO multiple pins output High voltage level without impact
 * pins.
 *
 * Set GPIO multiple pins output High voltage level without impact other pins. Multiple
 * pins are configured by OR enumerator from @ref _gpio_pin
 *
 * @param base      GPIO peripheral base pointer
 * @param u16Pins   GPIO pins which is ORed by @ref _gpio_pin. # kGPIO_Pin0 | kGPIO_Pin3
 *                  means Pin 0 and Pin 3.
 */
static inline void GPIO_PortSet(GPIO_Type *base, uint16_t u16Pins)
{
    base->DR |= u16Pins;
}

/*!
 * @brief Output High voltage level for GPIO Pin when configured as Output.
 *
 * Output High voltage level for GPIO Pin when configured as Output.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 */
static inline void GPIO_PinSet(GPIO_Type *base, gpio_pin_t ePin)
{
    GPIO_PortSet(base, (uint16_t)ePin);
}

/*!
 * @brief Set GPIO multiple pins belong to same PORT output Low voltage level when these pins
 * are configured as output.
 *
 * Set GPIO multiple pins belong to same PORT output Low voltage level when these pins are configured
 * as output. Multiple pins are configured by ORing enumerators from @ref _gpio_pin
 *
 * @param base      GPIO peripheral base pointer
 * @param u16Pins   GPIO pins which is ORed by @ref _gpio_pin. # kGPIO_Pin0 | kGPIO_Pin3
 *                  means Pin 0 and Pin 3.
 */
static inline void GPIO_PortClear(GPIO_Type *base, uint16_t u16Pins)
{
    base->DR &= ~u16Pins;
}

/*!
 * @brief Output Low voltage level for GPIO Pin when configured as Output.
 *
 * Output Low voltage level for GPIO Pin when configured as Output.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 */
static inline void GPIO_PinClear(GPIO_Type *base, gpio_pin_t ePin)
{
    GPIO_PortClear(base, (uint16_t)ePin);
}

/*!
 * @brief Toggle GPIO multiple pins belong to same PORT when these pins are configured as output.
 *
 * Toggle GPIO multiple pins belong to same PORT when these pins are configured as output.
 * Multiple pins are configured by ORing enumerators from @ref _gpio_pin
 *
 * @param base      GPIO peripheral base pointer
 * @param u16Pins   GPIO pins which is ORed by @ref _gpio_pin. # kGPIO_Pin0 | kGPIO_Pin3
 *                  means Pin 0 and Pin 3.
 */
static inline void GPIO_PortToggle(GPIO_Type *base, uint16_t u16Pins)
{
    base->DR ^= u16Pins;
}

/*!
 * @brief Toggle the GPIO output voltage level when configured as Output.
 *
 * Toggle the GPIO output voltage level when configured as Output.
 *
 * @note  GPIO peripheral register do not get register to toggle directly. It is
 * implemented by read back the GPIO output level and write to the register with
 * reverted level.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 */

