nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_gpio.h
static inline void GPIO_PinToggle(GPIO_Type *base, gpio_pin_t ePin)
{
    GPIO_PortToggle(base, (uint16_t)ePin);
}

/*!
 * @brief Read High/Low voltage level for multiple GPIO pins from the pin or the data bus.
 *
 * Read High/Low voltage level for multiple GPIO pins from the pin if the pin is configured
 * as input or the data bus.
 * When the device comes out of reset, GPIO pins are configured as inputs with internal
 * pull disabled. As a result, the reset value of this pin is undefined.
 * For different PORT,  the available pins number is different. User need use the return value
 * to OR with the @ref _gpio_pin to decide whether that pin is logic high or low.
 * @code
 *      if (GPIO_PortRead(GPIOA) & (uint16_t)kGPIO_Pin0)
 *      {
 *          //GPIOA Pin 0 is High
 *      }
 *      else
 *      {
 *          //GPIOA Pin 0 is Low
 *      }
 * @endcode
 *
 * @param  base      GPIO peripheral base pointer
 * @param  u16Pins   GPIO pins which is ORed by @ref _gpio_pin. # kGPIO_Pin0 | kGPIO_Pin3
 *                   means Pin 0 and Pin 3.
 * @return Voltage level for multiple GPIO pins from the pin or the data bus.
 */
static inline uint16_t GPIO_PortRead(GPIO_Type *base)
{
    return base->DR;
}

/*!
 * @brief Read High/Low voltage level for one GPIO pin from the pin or the data bus.
 *
 * Read High/Low voltage level from the pin if the pin is configured as input
 * or the data bus.
 * @note When the device comes out of reset, GPIO pins are configured as inputs with internal
 * pull disabled. As a result, the reset value of this pin is undefined.
 *
 * @param  base     GPIO peripheral base pointer
 * @param  ePin     GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 * @retval 1        Voltage level for one GPIO pin from the pin or the data bus is high.
 * @retval 0        Voltage level for one GPIO pin from the pin or the data bus is low.
 */
static inline uint8_t GPIO_PinRead(GPIO_Type *base, gpio_pin_t ePin)
{
    return (GPIO_PortRead(base) & (uint16_t)ePin) ? 1U : 0U;
}

/*!
 * @brief Read Raw voltage high/low level data from the pins or peripheral bus for multiple
 * pins belong to same PORT.
 *
 * Read Raw voltage high/low level data from the pins or peripheral bus. Values are
 * not clocked and are subject to change at any time. Read several times to ensure
 * a stable value. The reset value of this register depends on the default PIN state.
 * User need use the return value to OR with the @ref _gpio_pin to decide whether that
 * pin is logic high or low.
 * @code
 *      if (GPIO_PortReadRawData(GPIOA) & (uint16_t)kGPIO_Pin0)
 *      {
 *          //GPIOA Pin 0 is High
 *      }
 *      else
 *      {
 *          //GPIOA Pin 0 is Low
 *      }
 * @endcode
 *
 * @param  base      GPIO peripheral base pointer
 * @return Voltage high/low level data from the pins or peripheral bus for multiple
 *         pins belong to same PORT.
 */
static inline uint16_t GPIO_PortReadRawData(GPIO_Type *base)
{
    return base->RAWDATA;
}

/*!
 * @brief Read Raw logic level data from the pins or peripheral bus for one pin.
 *
 * Read Raw voltage high/low level data from the pins or peripheral bus. Values are
 * not clocked and are subject to change at any time. Read several times to ensure
 * a stable value. The reset value of this register depends on the default PIN state.
 *
 * @param  base     GPIO peripheral base pointer
 * @param  ePin     GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 * @retval 1        Raw voltage level data from the pins or peripheral bus is high.
 * @retval 0        Raw voltage level data from the pins or peripheral bus is low.
 */
static inline uint8_t GPIO_PinReadRawData(GPIO_Type *base, gpio_pin_t ePin)
{
    return (GPIO_PortReadRawData(base) & (uint16_t)ePin) ? 1U : 0U;
}

/* @} */

/*!
 * @name GPIO Interrupt Interfaces
 * @{
 */

/*!
 * @brief Configure GPIO Pin interrupt detection condition.
 *
 * Configure GPIO Pin interrupt detection condition
 *
 * @param base          GPIO peripheral base pointer
 * @param ePin          GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                      in SoC and user need to check the data sheet.
 * @param eIntConfig    Interrupt detection condition for rising edge/down edge or no detection. See
 *                      @ref _gpio_interrupt_mode
 */
static inline void GPIO_PinSetInterruptConfig(GPIO_Type *base, gpio_pin_t ePin, gpio_interrupt_mode_t eIntConfig)
{
    if (eIntConfig != kGPIO_InterruptDisable)
    {
        /* Configure the Interrupt detection edge. */
        if (eIntConfig == kGPIO_InterruptRisingEdge)
        {
            base->IPOLR &= ~(uint16_t)ePin;
        }
        else
        {
            base->IPOLR |= (uint16_t)ePin;
        }
        /* Enable the Pin Interrupt*/
        base->IENR |= (uint16_t)ePin;
    }
    else
    {
        /* Disable the Pin Interrupt*/
        base->IENR &= (~(uint16_t)ePin);
    }
}

/*!
 * @brief Assert software interrupt for multiple pins belong to same port which will generate interrupt.
 *
 * This API is only for software testing of a software interrupt
 * capability. When the software interrupt is asserted, an interrupt is
 * generated. The interrupt is generated continually until this software
 * interrupt is de-asserted.
 *
 * @param base      GPIO peripheral base pointer
 * @param u16Pins   GPIO pins which is ORed by @ref _gpio_pin. # kGPIO_Pin0 | kGPIO_Pin3
 *                  means Pin 0 and Pin 3.
 */
static inline void GPIO_PortAssertSWInterrupts(GPIO_Type *base, uint16_t u16Pins)
{
    base->IAR |= u16Pins;
}

/*!
 * @brief De-Assert software interrupt for multiple pins belong to same port which will stop generating interrupt.
 *
 * This API is only for software testing of a software interrupt
 * capability.
 *
 * @param base      GPIO peripheral base pointer
 * @param u16Pins   GPIO pins which is ORed by @ref _gpio_pin. # kGPIO_Pin0 | kGPIO_Pin3
 *                  means Pin 0 and Pin 3.
 */
static inline void GPIO_PortDeassertSWInterrupts(GPIO_Type *base, uint16_t u16Pins)
{
    base->IAR &= ~u16Pins;
}

/*!
 * @brief Assert software interrupt for one pin which will generate interrupt.
 *
 * This API is only for software testing of a software interrupt
 * capability. When the software interrupt is asserted, an interrupt is
 * generated. The interrupt is generated continually until this software
 * interrupt is de-asserted.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 */
static inline void GPIO_PinAssertSWInterrupt(GPIO_Type *base, gpio_pin_t ePin)
{
    GPIO_PortAssertSWInterrupts(base, (uint16_t)ePin);
}

/*!
 * @brief De-Assert software interrupt for one pin which will stop generating interrupt.
 *
 * This API is only for software testing of a software interrupt
 * capability.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 */
static inline void GPIO_PinDeassertSWInterrupt(GPIO_Type *base, gpio_pin_t ePin)
{
    GPIO_PortDeassertSWInterrupts(base, (uint16_t)ePin);
}

/*!
 * @brief Enable interrupt detection for multiple pins belong to same port
 *
 * This API is to enable interrupt detection on rising edge or falling edge.
 *
 * @param base      GPIO peripheral base pointer
 * @param u16Pins   GPIO pins which is ORed by @ref _gpio_pin. # kGPIO_Pin0 | kGPIO_Pin3
 *                  means Pin 0 and Pin 3.
 */
static inline void GPIO_PortEnableInterrupts(GPIO_Type *base, uint16_t u16Pins)
{
    base->IENR |= u16Pins;
}

/*!
 * @brief Disable interrupt detection for multiple pins belong to same port.
 *
 * This API is to disable interrupt detection on rising edge or falling edge.
 *
 * @param base      GPIO peripheral base pointer
 * @param u16Pins   GPIO pins which is ORed by @ref _gpio_pin. # kGPIO_Pin0 | kGPIO_Pin3
 *                  means Pin 0 and Pin 3.
 */
static inline void GPIO_PortDisableInterrupts(GPIO_Type *base, uint16_t u16Pins)
{
    base->IENR &= ~u16Pins;
}

/*!
 * @brief Enable interrupt detection for one pin.
 *
 * This API is to enable interrupt detection on rising edge or falling edge.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 */
static inline void GPIO_PinEnableInterrupt(GPIO_Type *base, gpio_pin_t ePin)
{
    GPIO_PortEnableInterrupts(base, (uint16_t)ePin);
}

/*!
 * @brief Disable interrupt detection for one pin.
 *
 * This API is to disable interrupt detection on rising edge or falling edge.
 *
 * @param base      GPIO peripheral base pointer
 * @param ePin      GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 */
static inline void GPIO_PinDisableInterrupt(GPIO_Type *base, gpio_pin_t ePin)
{
    GPIO_PortDisableInterrupts(base, (uint16_t)ePin);
}

/* @} */

/*!
 * @name GPIO Status Get/Clear Interfaces
 * @{
 */

/*!
 * @brief Get interrupt pending status flags all pins belong to same port.
 *
 * Get interrupt pending status flags for all pins belong to same port. User need to use
 * the @ref _gpio_pin_t to OR with the return value, if the result is not 0, this flag is set.
 * otherwise, this flag is not set.
 *
 * @note this flags can only be cleared by calling GPIO_PortClearEdgeDetectedStatusFlag
 * if it is caused by edge detected or by calling GPIO_PortEnableSWInterrupt if it is caused
 * by SW interrupt.
 * @code
 *      if (GPIO_PortGetInterruptPendingStatusFlags(GPIOA) & (uint16_t)kGPIO_Pin0)
 *      {
 *          //Interrupt occurred on GPIOA Pin 0.
 *      }
 *      else
 *      {
 *          //No Interrupt on GPIOA Pin 0.
 *      }
 * @endcode
 *
 * @param  base      GPIO peripheral base pointer
 * @return Interrupt pending status flags all pins belong to same port.
 */
static inline uint16_t GPIO_PortGetInterruptPendingStatusFlags(GPIO_Type *base)
{
    return base->IPR;
}

/*!
 * @brief Get interrupt pending status flags for one pin.
 *
 * Get interrupt pending status flags for one pin.
 * @note this flags can only be cleared by calling GPIO_PortClearEdgeDetectedStatusFlag
 * if it is caused by edge detected or by calling GPIO_PortEnableSWInterrupt if it is caused
 * by SW interrupt.
 *
 * @param  base     GPIO peripheral base pointer
 * @param  ePin     GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 * @retval 1        Interrupt occurred.
 * @retval 0        No Interrupt.
 */
static inline uint16_t GPIO_PinGetInterruptPendingStatusFlags(GPIO_Type *base, gpio_pin_t ePin)
{
    return (GPIO_PortGetInterruptPendingStatusFlags(base) & (uint16_t)ePin) ? 1U : 0U;
}

/*!
 * @brief Get Edge detected status flags for all pins belong to same port.
 *
 * Get edge detected status flags for all pins in the PORT. This status flag can only be detected
 * when interrupt detection is enabled by GPIO_PortEnableInterrupt or GPIO_PinEnableInterrupt.
 * @code
 *      if (GPIO_PortGetEdgeDetectedStatusFlags(GPIOA) & (uint16_t)kGPIO_Pin0)
 *      {
 *          //An edge detected on GPIOA Pin 0.
 *      }
 *      else
 *      {
 *          //No edge detected on GPIOA Pin 0.
 *      }
 * @endcode
 *
 * @param  base      GPIO peripheral base pointer
 * @return Detected edge status flags for all pins belong to same port.
 */
static inline uint16_t GPIO_PortGetEdgeDetectedStatusFlags(GPIO_Type *base)
{
    return base->IESR;
}

/*!
 * @brief Get Edge detected status flags for one pin.
 *
 * Get edge detected status flags for one pin. This status flag can only be detected when
 * interrupt detection is enabled by GPIO_PortEnableInterrupt or GPIO_PinEnableInterrupt.
 *
 * @param  base     GPIO peripheral base pointer
 * @param  ePin     GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *                  in SoC and user need to check the data sheet.
 * @retval 1        An edge detected.
 * @retval 0        No edge detected.
 */
static inline uint8_t GPIO_PinGetEdgeDetectedStatusFlag(GPIO_Type *base, gpio_pin_t ePin)
{
    return (GPIO_PortGetEdgeDetectedStatusFlags(base) & (uint16_t)ePin) ? 1U : 0U;
}

/*!
 * @brief Clear Edge detected status flags for multiple pins belong to same port.
 *
 * Clear Edge Detected status flags for multiple pins belong to same port.
 *
 * @param base      GPIO peripheral base pointer
 * @param u16Pins   GPIO pins which is ORed by @ref _gpio_pin. # kGPIO_Pin0 | kGPIO_Pin3
 *                  means Pin 0 and Pin 3.
 */
static inline uint16_t GPIO_PortClearEdgeDetectedStatusFlags(GPIO_Type *base, uint16_t u16Pins)
{
    base->IESR = u16Pins;
}

/*!
 * @brief Clear Edge detected status flags for one pin.
 *
 * Clear Edge Detected status flags for one pin.
 *
 * @param base  GPIO peripheral base pointer
 * @param ePin  GPIO pin identifier. User enumerator provided by @ref _gpio_pin. Note that not all Pins existed
 *              in SoC and user need to check the data sheet.
 */
static inline uint16_t GPIO_PinClearEdgeDetectedStatusFlags(GPIO_Type *base, gpio_pin_t ePin)
{
    GPIO_PortClearEdgeDetectedStatusFlags(base, (uint16_t)ePin);
}

/* @} */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */

#endif /* _FSL_GPIO_H_*/
